InformationRegisters/RVY_Вебхуки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>RVY_Вебхуки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/RVY_ОбщийМодульКлиент/Ext/Module.bsl
//#13148

#Область ПрограммныйИнтерфейс

Процедура ОтправитьДокументВRevvy(ОбъектСсылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ОбъектСсылка) Тогда
		Сообщить("Документ должен быть записан");
		Возврат;
	КонецЕсли;
	
	СтруктураСостоянияДокумента = RVY_ОбщийМодульВызовСервера.ПолучитьСостояниеДокумента(ОбъектСсылка);
	Если СтруктураСостоянияДокумента.Состояние = 2 Тогда
		Сообщить("Документ был отправен в Revvy " + Строка(СтруктураСостоянияДокумента.ДатаОтправки));
		Возврат;
	КонецЕсли;
	
	// выбор контакта	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьДокументВRevvyЗавершение", ЭтотОбъект, ОбъектСсылка);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СсылкаОбъект", ОбъектСсылка); 
 	
	ОткрытьФорму("РегистрСведений.RVY_Вебхуки.Форма.ФормаВыбораКонтакта", ПараметрыФормы, ,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ОтправитьДокументВRevvyЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДанныеКонтакта = Результат;
	Если НЕ ТипЗнч(ДанныеКонтакта) = Тип("Структура") Тогда
		Возврат; 
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеКонтакта.НомерТелефона) Тогда
		Сообщить("Не указан контактный телефон");
		Возврат;
	КонецЕсли;
	
	ОбъектСсылка = ДополнительныеПараметры;	
	ДатаДобавления = ТекущаяДата();
	РезультатОтправки = RVY_ОбщийМодульКлиентСервер.ОтправитьВRevvy(ДанныеКонтакта.Контакт, ДанныеКонтакта.НомерТелефона);
	Если РезультатОтправки Тогда
		RVY_ОбщийМодульВызовСервера.СохранитьСостояниеДокумента(ОбъектСсылка, ДанныеКонтакта.Контакт, ДанныеКонтакта.НомерТелефона, ДатаДобавления, ДатаДобавления);	
		Оповестить("ОтправитьДокументВRevvy", ОбъектСсылка);
	Иначе
		// запрос отправить не удалось, сохраним информацию в регистр без заполнения даты отправки
		RVY_ОбщийМодульВызовСервера.СохранитьСостояниеДокумента(ОбъектСсылка, ДанныеКонтакта.Контакт, ДанныеКонтакта.НомерТелефона, ДатаДобавления);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
